package a18

class 类型匹配[T]

object 类型匹配 {
  def apply[T]                                              = new 类型匹配[T]
  def apply[T](i: 类型匹配[T], ii: 类型匹配[T]): (类型匹配[T], 类型匹配[T]) = (i, i)
}

object 测试 {

  类型匹配(类型匹配[进位#_1#_2], 类型匹配[S_2[S_1[进位]]])

  类型匹配(类型匹配[进位#_9#_9#_8#Up#Up#Up], 类型匹配[进位#_1#_0#_0#_1])
  类型匹配(类型匹配[进位#_2#_3#_9#Up], 类型匹配[进位#_2#_4#_0])

  类型匹配(类型匹配[进位#_2#_3#_3#Up#Up#Up], 类型匹配[进位#_2#_3#_6])
  类型匹配(类型匹配[进位#_1#_2#_4#_4#Up#Up#Up], 类型匹配[进位#_1#_2#_4#_7])

  def main(arr: Array[String]): Unit = {
    println("22")
  }
}
