package version2

import scala.language.higherKinds

object Runner extends App {

  val 水尺  = 初始水尺.下一重.下一重.下一重.下一重
  val 大海1 = 大海之初.加水(1).加水("水2").加水(3).加水("水4").加水("水5").加水("水6").加水("水7")
  println(s"大海: ${大海1}\n")
  val 去水1 = 水尺.检验(大海1).目前去水
  val 大海2 = 去水1.去(大海1)
  println(s"大海: ${大海2}\n")
  val 去水2 = 水尺.检验(大海2).目前去水
  val 大海3 = 去水2.去(大海2)
  println(s"大海: ${大海3}\n")
  val 去水3 = 水尺.检验(大海3).目前去水
  val 大海4 = 去水3.去(大海3)
  println(s"大海: ${大海4}\n")
  val 去水4 = 水尺.检验(大海4).目前去水
  val 大海5 = 去水4.去(大海4)
  println(s"大海: ${大海5}\n")
  val 去水5 = 水尺.检验(大海5).目前去水
  val 大海6 = 去水5.去(大海5)
  println(s"大海: ${大海6}\n")
  val 去水6 = 水尺.检验(大海6).目前去水
  val 大海7 = 去水6.去(大海6)
  println(s"大海: ${大海7}\n")
  val 去水7 = 水尺.检验(大海7).目前去水
  val 大海8 = 去水7.去(大海7)
  println(s"大海: ${大海8}\n")

}
