package version2

import scala.language.higherKinds

object Runner extends App {

  val 水尺  = 初始水尺.下一重.下一重.下一重.下一重
  val 池塘1 = 池塘之初.加水(1).加水("水2").加水(3).加水("水4").加水("水5").加水("水6").加水("水7")
  println(s"池塘: ${池塘1}\n")
  val 去水1 = 水尺.检验(池塘1).目前去水
  val 池塘2 = 去水1.去(池塘1)
  println(s"池塘: ${池塘2}\n")
  val 去水2 = 水尺.检验(池塘2).目前去水
  val 池塘3 = 去水2.去(池塘2)
  println(s"池塘: ${池塘3}\n")
  val 去水3 = 水尺.检验(池塘3).目前去水
  val 池塘4 = 去水3.去(池塘3)
  println(s"池塘: ${池塘4}\n")
  val 去水4 = 水尺.检验(池塘4).目前去水
  val 池塘5 = 去水4.去(池塘4)
  println(s"池塘: ${池塘5}\n")
  val 去水5 = 水尺.检验(池塘5).目前去水
  val 池塘6 = 去水5.去(池塘5)
  println(s"池塘: ${池塘6}\n")
  val 去水6 = 水尺.检验(池塘6).目前去水
  val 池塘7 = 去水6.去(池塘6)
  println(s"池塘: ${池塘7}\n")
  val 去水7 = 水尺.检验(池塘7).目前去水
  val 池塘8 = 去水7.去(池塘7)
  println(s"池塘: ${池塘8}\n")

}
