package version1

object Runner extends App {

  val 水尺  = 初始水尺.下一重.下一重.下一重.下一重
  val 大海1 = 大海之初.加水(1).加水("水2").加水(3)
  println(s"大海: ${大海1}\n")
  val 舀水1 = 水尺.检验(大海1).目前舀水
  val 大海2 = 舀水1.舀(大海1, "水4")
  println(s"大海: ${大海2}\n")
  val 舀水2 = 水尺.检验(大海2).目前舀水
  val 大海3 = 舀水2.舀(大海2, "水5")
  println(s"大海: ${大海3}\n")
  val 舀水3 = 水尺.检验(大海3).目前舀水
  val 大海4 = 舀水3.舀(大海3, 6)
  println(s"大海: ${大海4}\n")
  val 舀水4 = 水尺.检验(大海4).目前舀水
  val 大海5 = 舀水4.舀(大海4, "水7")
  println(s"大海: ${大海5}\n")
  val 舀水5 = 水尺.检验(大海5).目前舀水
  val 大海6 = 舀水5.舀(大海5, "水8")
  println(s"大海: ${大海6}\n")

}
