package version1

object Runner extends App {

  val 水尺  = 初始水尺.下一重.下一重.下一重.下一重
  val 池塘1 = 池塘之初.加水(1).加水("水2").加水(3)
  println(s"池塘: ${池塘1}\n")
  val 舀水1 = 水尺.检验(池塘1).目前舀水
  val 池塘2 = 舀水1.舀(池塘1, "水4")
  println(s"池塘: ${池塘2}\n")
  val 舀水2 = 水尺.检验(池塘2).目前舀水
  val 池塘3 = 舀水2.舀(池塘2, "水5")
  println(s"池塘: ${池塘3}\n")
  val 舀水3 = 水尺.检验(池塘3).目前舀水
  val 池塘4 = 舀水3.舀(池塘3, 6)
  println(s"池塘: ${池塘4}\n")
  val 舀水4 = 水尺.检验(池塘4).目前舀水
  val 池塘5 = 舀水4.舀(池塘4, "水7")
  println(s"池塘: ${池塘5}\n")
  val 舀水5 = 水尺.检验(池塘5).目前舀水
  val 池塘6 = 舀水5.舀(池塘5, "水8")
  println(s"池塘: ${池塘6}\n")

}
